Repository: fzampirolli/mctest
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt

source: The given username must be set
pt: O nome do usuário deve ser fornecido

source: username
pt: Nome do usuário

source: Required. 15 characters or fewer. Letters, numbers and @/./+/-/_ characters
pt: Obrigatório. 15 caracteres ou menos. Letras, números e @/./+/-/_ apenas.

source: Enter a valid username.
pt: Entre com um usuário válido

source: invalid
pt: inválido

source: first name
pt: primeiro nome

source: last name
pt: último nome

source: email address
pt: endereço de email

source: staff status
pt: status da equipe

source: Designates whether the user can log into this admin site.
pt: Designa se o usuário pode efetuar login neste site admin

source: active
pt: ativo

source: Designates whether this user should be treated as active. Unselect this instead of deleting accounts.
pt: Designa se este usuário deve ser tratato como ativo. Desmarque isto em vez de excluir contas.

source: date joined
pt: data de cadastro

source: trusty
pt: seguro

source: Designates whether this user has confirmed his account.
pt: Designa se este usuário confirmou a conta.

source: user
pt: usuário

source: users
pt: Usuários

source: Institute name
pt: Nome do Instituto

source: Institute code
pt: Código Instituto

source: Institute logo
pt: Logo do Instituto

source: All teachers must register institutional email
pt: Todos os professores devem registrar e-mail institucional

source: Institute url
pt: URL do Instituto

source: Total of exams generated per student. Remember, when creating an exam, it can be applied across multiple classrooms and to multiple students.
pt: Total de exames gerados por aluno. Lembre-se, ao criar um exame, ele pode ser aplicado em várias salas de aula e em vários alunos.

source: Exams generated by the Institute
pt: Exames gerados pelo Instituto

source: Total of corrected exams. Remember, some students may be absent.
pt: Total de exames corrigidos. Lembre-se, alguns alunos podem estar ausentes.

source: Exams corrected by the Institute
pt: Exames corrigidos pelo Instituto

source: Total of corrected question.
pt: Total de questões corrigidas.

source: Questions corrected by the Institute
pt: Questões corrigidas pelo Instituto

source: Institute professors
pt: Professores do Instituto

source: Institute coordinators
pt: Coordenadores do Instituto

source: Course name - does not include the institute code
pt: Nome do curso - não incluir o código

source: Course name
pt: Nome Curso

source: Course code
pt: Código Curso

source: Course professors
pt: Professores do Curso

source: Course coordinators
pt: Coordenadores do Curso

source: Discipline course
pt: Disciplinas do Curso

source: Discipline name
pt: Nome Disciplina

source: Discipline code
pt: Código da Disciplina

source: Discipline objective
pt: Objetivo Disciplina

source: Discipline professors
pt: Professores da Disciplina

source: Discipline coordinators
pt: Coordenadores da Disciplina

source: Classroom students
pt: Estudantes da Turma

source: Classroom discipline
pt: Disciplina da Turma

source: Classroom professors
pt: Professores da Turma

source: Classroom code
pt: Código Turma

source: Classroom room
pt: Sala da Turma

source: Classroom period
pt: Período Turma

source: Classroom type
pt: Tipo de Turma

source: Delete Classroom
pt: Apagar Turma

source: Classroom
pt: Turma

source: An exam cannot exist without a marked classroom!!!
pt: Um exame não pode existir sem PELO MENOS uma turma marcada !!!

source: Before deleting, MAKE SURE you do not have any other exams associated with this class.
pt: Antes de excluir, CERTIFIQUE-SE de que você não tenha nenhum outro exame associado a esta turma.

source: Exams associated with this class
pt: Exames associados com esta turma

source: Remove this exam first or add another class to this exam
pt: Remover este Exame primeiro ou incluir outra turma neste Exame

source: Classrooms from discipline
pt: Disciplina desta turma

source: Exam
pt: Exame

source: has ONLY ONE classroom:
pt: TEM APENAS UMA TURMA:

source: Cancel
pt: Cancelar

source: Delete
pt: Apagar

source: Only teacher registered in a discipline
pt: Somente professores cadastrados em disciplinas

source: Contact your discipline coordinator
pt: Entre em contato com o coordenador da disciplina

source: Created a new Classroom
pt: Criar uma nova Turma

source: Choose Discipline
pt: Escolher Disciplinas

source: Choose Profs
pt: Escolher Prof(s)

source: If you are not the course coordinator, to include students you must choose at least one teacher from the class
pt: Se você não é o coordenador da disciplina, para incluir os alunos deve-se escolher pelo menos um professor da turma

source: The teacher who creates a class and does NOT mark the email above will NOT be able to add students to the class
pt: O professor que criar uma turma e NÃO marcar o e-mail acima NÃO poderá adicionar alunos à turma

source: Search with CTRL+F
pt: Buscar com CTRL+F

source: Hold CTRL to mark more than one teacher
pt: Segure CTRL para marcar mais de um professor

source: Code
pt: Código

source: Room
pt: Sala

source: Period
pt: Período

source: Format
pt: Formatar

source: Type
pt: Tipo

source: Back
pt: Voltar

source: Import students by csv file in My Classrooms
pt: Importar estudantes por aquivo csv em Minhas Turmas

source: Classroom Detail
pt: Detalhar Turma

source: Students List
pt: Listar Estudantes

source: Student
pt: Estudante

source: Actions
pt: Ações

source: Update
pt: Atualizar

source: Classrooms
pt: Turmas

source: There are no
pt: Não existe

source: registered yet.
pt: registrada(o) ainda

source: No permission to access this content!
pt: Sem permissão para acessar esse conteúdo!

source: Name
pt: Nome

source: Create a new Student
pt: Criar um novo Estudante

source: Update Classroom by CSV
pt: Atualizar Turma com CSV

source: Attention, a student may be many classrooms
pt: Atenção, um estudante pode ter muitas turmas

source: One student will be removed from the class
pt: Um estudante será removido da turma

source: Import students by CSV file in Update Classroom
pt: Importar estudantes por aquivo CSV em Minhas Turmas

source: Only teacher registered in Classroom or coordinator
pt: Somente professores cadastrados na turma ou coordenador

source: Classrooms List
pt: Listar Turmas

source: Classroom Code
pt: Código da Turma

source: Discipline
pt: Disciplina

source: There is no
pt: Não existe

source: Create a New Classroom
pt: Criar uma nova Turma

source: Classroom Update
pt: Atualizar Turma

source: Include multiple Students from a CSV file
pt: Incluir vários estudantes de um arquivo CSV

source: Choose CSV file
pt: Escolher arquivo CSV

source: Upload-Students
pt: Importar-Estudantes

source: CSV Syntax
pt: Sintaxe do arquivo CSV

source: Separators
pt: Separadores

source: or
pt: ou

source: Encoding
pt: Codificação

source: Efficiency Type
pt: Tipo eficiente

source: The most efficient way to add students is via
pt: A maneira mais eficiente de adicionar estudantes é via

source: CSV Import
pt: Importação CSV

source: The selection fields below are intended primarily for verification or minor adjustments.
pt: Os campos de seleção abaixo destinam-se principalmente à verificação ou pequenos ajustes.

source: Manual selection is not recommended for large classes.
pt: A seleção manual não é recomendada para turmas grandes.

source: Students
pt: Estudantes

source: Only teacher registered in classroom or coordenator
pt: Somente professores cadastrados em disciplinas ou coordenador

source: Delete Course
pt: Apagar este Curso

source: Are you sure you want to delete the course
pt: Tem certeza que deseja abagar este curso

source: Only admin can update/create/delete institutes/courses/disciplines
pt: Somente admin pode criar/atualizar/apagar institutos/cursos/disciplinas

source: Create a New Course
pt: Criar um novo Curso

source: Choose Institutes
pt: Escolha Instituto(s)

source: Course Detail
pt: Detalhar Curso

source: Course
pt: Curso

source: Discipline List
pt: Listar Disciplinas

source: Create a New Discipline
pt: Criar uma nova Disciplina

source: Course List
pt: Listar Cursos

source: Institute
pt: Instituto

source: Update Course
pt: Atualizar Curso

source: Delete Discipline
pt: Apagar Disciplina

source: Are you sure you want to delete the discipline
pt: Tem certeza que deseja abagar esta disciplina

source: Choose Courses
pt: Escolher Curso(s)

source: Objective
pt: Objetivo

source: Discipline Detail
pt: Detalhar Disciplina

source: Coordinator
pt: Coordenador

source: Topic List
pt: Listar Tópicos

source: Topic
pt: Tópico

source: There is not
pt: Não existe

source: Create a New Topic
pt: Criar um novo Tópico

source: Only coordinator can create/update/delate topic
pt: Somente coordenandor pode criar/atualizar/apagar tópicos

source: Classroom List
pt: Listar Turmas

source: Only professor can create/update/delate classroom
pt: Somente coordenandor pode criar/atualizar/apagar tópicos

source: Only the coordinator can update your discipline
pt: Somente coordenador pode atualizar disciplina

source: Discipline Update
pt: Atualizar Disciplina

source: Include multiple Profs from a CSV file
pt: Incluir vários professores em um arquivo CSV

source: First Name
pt: Primeiro Nome

source: Last Name
pt: Último Nome

source: Create multiple Classrooms from a CSV file
pt: Criar várias turmas de um arquivo CSV

source: Upload-Classrooms
pt: Upload-Turmas

source: ATTENTION
pt: ATENÇÃO

source: This scheme will remove all students from existing classrooms!
pt: ATENÇÃO: este esquema irá remover todos os estudantes existentes em *TODAS AS TURMAS* desta disciplina

source: CSV Syntax & Example
pt: Sintaxe CSV e Exemplos

source: Notes
pt: Notas

source: Existing students with same ID will be updated.
pt: Estudantes já existentes com o mesmo ID serão atualizados.

source: Classrooms will be created automatically if they don't exist.
pt: Turmas serão criadas automaticamente caso não existam.

source: Professors must already be registered in the system to be added.
pt: Os professores já devem estar cadastrados no sistema para serem adicionados.

source: Delete Institute
pt: Apagar Instituto

source: Are you sure you want to delete the institute
pt: Tem certeza que deseja abagar este instituto

source: Create a New Institute
pt: Criar um novo Instituto

source: Exams generated
pt: Exames gerado

source: Exams corrected
pt: Exames corrigidos

source: Questions corrected
pt: Questões corrigidas

source: Institute Detail
pt: Detalhar Instituto

source: Institute List
pt: Listar Institutos

source: Institute Update
pt: Atualizar Instituto

source: Create a new Institute
pt: Criar um novo Instituto

source: ImportClassroomsDiscipline: choose a CSV following the model
pt: ImportClassroomsDiscipline: escolher um arquivo CSV seguindo o modelo

source: Return to:
pt: Retorno para:

source: Teacher not registered:
pt: Professor não registrado;

source: Discipline profs
pt: Professores da Disciplina

source: Registered:
pt: Registrado;

source: Not registered:
pt: Não registrado;

source: ImportProfsDiscipline: choose a CSV following the model!
pt: ImportProfsDiscipline; escolher um arquivo CVS seguindo o modelo

source: List of Professors
pt: Lista de Professores

source: ImportStudentsClassroom: choose a CSV following the model
pt: ImportStudentsClassroom: escolher um arquivo CSV seguindo o modelo

source: ImportStudentsClassroom: ID must be digits only:
pt: ImportStudentsClassroom: ID tem que ter somente dígitos:

source: Back to Classroom Detail
pt: Voltar para detalhes da turma

source: ClassroomUpdate: The teacher is not registered in a Discipline
pt: ClassroomUpdate: o professor não está registrado na disciplina

source: ClassroomCreate: The teacher is not registered in a Discipline
pt: ClassroomCreate: o professor não está registrado na disciplina

source: ClassroomDelete: The teacher is not registered in a Discipline
pt: ClassroomDelete: o professor não está registrado na disciplina

source: Multiple Choice Questions
pt: Questões de Múltipla Escolha

source: Correct answer
pt: Alternativa correta

source: Your answer
pt: Sua alternativa

source: Text Questions
pt: Questões Dissertativas

source: Instructions
pt: Instruções

source: Term
pt: Período

source: Exam
pt: Exame

source: Date
pt: Data

source: validateNumQuestions: The number of selected multiple-choice questions is inconsistent
pt: validateNumQuestions: o número de questões de múltipla-escolha escolhidas é incosistente

source: validateNumQuestions: the number of Text questions is inconsistent
pt: validateNumQuestions: o número de questões dissertativa escolhidas é incosistente

source: validateNumQuestions: You chose Both. Is it right? Number of QM questions >=3
pt: validateNumQuestions: você escolher Ambos. Isto está correto? Número de questões QM >=3

source: validateNumQuestions: You chose Anwsers. Is it right? Number of QM questions >=3
pt: validateNumQuestions: você escolhe Alternativas. Isto está correto? Número de questões QM >=3

source: validateNumQuestions: You chose Questions. Is it right? Number of QM questions >=3
pt: validateNumQuestions: você escolher Questões. Isto está correto? Número de questões QM >=3

source: validateNumQuestions: number of QM difficulty questions var1
pt: validateNumQuestions: número de questões QM com dificuldade var1

source: validateNumQuestions: number of QM difficulty questions var2
pt: validateNumQuestions: número de questões QM com dificuldade var2

source: validateNumQuestions: number of QM difficulty questions var3
pt: validateNumQuestions: número de questões QM com dificuldade var3

source: validateNumQuestions: number of QM difficulty questions var4
pt: validateNumQuestions: número de questões QM com dificuldade var4

source: validateNumQuestions: number of QM difficulty questions var5
pt: validateNumQuestions: número de questões QM com dificuldade var5

source: ERROR: Each block must have at least 3 questions/answers
pt: ERRO: Cada bloco deve ter pelo menos 3 questões/respostas

source: drawQuestionsMCDifficulty: Topic of the chosen question does not belong to the discipline
pt: drawQuestionsMCDifficulty: Tópico da questão escolhida não pertence à disciplina

source: drawQuestionsMCDifficulty: Error in parametric question
pt: drawQuestionsMCDifficulty: erro na questão paramétrica

source: drawQuestionsMCDifficulty: number of answers different: Exam; Question:
pt: drawQuestionsMCDifficulty: número de alternativas são diferentes: Exame; Questão

source: drawQuestionsTDifficulty: Error in compression textual questions
pt: drawQuestionsTDifficulty: erro na compressão da questão dissertativa

source: drawQuestionsTDifficultyVariations: Topic of the chosen question does not belong to the discipline
pt: drawQuestionsTDifficultyVariations: tópico da questão escolhida não pertence à disciplina

source: ERROR - students with same name
pt: ERRO - estudante com o mesmo nome

source: Exam name, for example, Exam 1
pt: Nome do exame, ex. Exame 1

source: Exam name
pt: Nome do Exame

source: Choose the classrooms
pt: Escolha as Turmas que você está cadastrado (se não existir, criar Turmas antes)

source: Choose the topics
pt: Escolher Tópico

source: Topics
pt: Tópicos

source: Choose the questions
pt: Escolha as Questões (de Disciplinas que você está cadastrado)

source: Questions
pt: Questões

source: Number of questions with difficulty level x
pt: Número de questões com nível de dificuldade X (apenas Múltipla-Escolha)

source: Difficulty 1
pt: Dificuldade 1

source: Difficulty 2
pt: Dificuldade 2

source: Difficulty 3
pt: Dificuldade 3

source: Difficulty 4
pt: Dificuldade 4

source: The system first draws the questions with difficulty 1, then 2, ...
pt: O sistema inclui primeiro as questões com dificuldade 1, então 2, ...

source: Difficulty 5
pt: Dificuldade 5

source: Number of answers per question
pt: Número de alternativas por questão

source: Answers per question
pt: Alternativas por questão

source: Number of textual questions
pt: Número de questões dissertativas

source: Textual
pt: Dissertativa

source: Number of exam variations
pt: Número de variações de exames

source: Variations
pt: Variações

source: Number of questions per block
pt: Número de questões por bloco

source: Questions by block
pt: Questões por bloco

source: Maximum number of blocks horizontally
pt: Número máximo de blocos na horizontal

source: Max blocks horiz.
pt: Max Blocos Horiz.

source: Presentations of questions in stylesheet
pt: Apresentações das questões no quadro de respostas (correções na horizontal está em desenvolvimento!)

source: Stylesheet
pt: Quadro de respostas

source: Generate answersheets; questions; both
pt: Gerar folha de respostas ou folhas de questões ou ambas

source: Answersheets/Questions/Both
pt: Respostas/Questões/Ambos

source: Ecological (reduce number of sheets)
pt: Ecológico (reduzir número de folhas em papel)

source: Ecological
pt: Ecológico

source: Send feedback to the student - Very attention! If you choose YES, an exam will be emailed to each student after clicking createPDF.
pt: Enviar retorno aos estudantes - Muita atenção! Se você escolher SIM, um exame será enviado por e-mail para cada aluno depois de clicar em Criar-PDF.

source: Student Feedback
pt: Retorno

source: Date of exam, format: DD/MM/YYYY
pt: Data do exame, formato: DD/MM/YYYY

source: Date Hour
pt: Data

source: Term of exam
pt: Quadrimestre

source: Who created this exam
pt: Quem criou este exame

source: Who created
pt: Quem criou

source: Exam instructions, for example, '\item turning off the phone'
pt: Instruções do exame, por exemplo '\item desligar o celular'

source: Answers
pt: Respostas

source: Both
pt: Ambos

source: Yes
pt: Sim

source: No
pt: Não

source: Yes - feedback: Header and All Questions; *createPDF* >> SEND EMAIL TO STUDENT WITH YOUR EXAM
pt: Sim - retorno: contendo cabeçalho e todas as questões; *Create-PDF* >> ENVIA EMAIL PARA TODOS OS ESTUDANTES COM O EXAME

source: Send feedback to the student
pt: Enviar-Retornos-Estudantes

source: Classroom where the exam will be held
pt: Sala onde o exame será realizado

source: Classroom/Lab.
pt: Sala/Lab.

source: Date/Hour of exam, format: DD/MM/YYYY HH:MM:SS
pt: Data do exame, formato: DD/MM/YYYY

source: First term
pt: Primeiro quadrimestre

source: Second term
pt: Segundo quadrimestre

source: Third term
pt: Terceiro quadrimestre

source: \item turning off the phone
pt: \item desligar o celular

source: Accepts LaTeX description and parameterization using the Python language (see publications).
pt: Aceita a descrição e parametrização do LaTeX usando a linguagem Python (consulte as publicações).

source: Description
pt: Descrição

source: Exam Grade
pt: Nota do Exame

source: Student Exam
pt: Exame doEstudante

source: Exam Question
pt: Questões do Exame

source: Student Answer
pt: Alternativa do Estudante

source: Answers Order
pt: Respostas em ordem

source: Discipline Grade
pt: Nome Disciplina

source: Delete Exam
pt: Apagar este Exame

source: Are you sure you want to delete the exam
pt: Tem certeza que deseja abagar este exame

source: Exams of the disciplines that I am enrolled
pt: Exames das disciplinas que eu participo

source: Create a new Exam
pt: Criar um novo Exame

source: N. Students
pt: N. Estudantes

source: See
pt: Ver

source: Column sorts are still not working correctly, use Search feature
pt: As ordenações de colunas ainda não estão funcionando corretamente, use o recurso de Busca

source: If you are not a coordinator, create an exam ONLY for your class
pt: Se você não é um coordenador, crie um exame SOMENTE para sua classe

source: Exame Detail
pt: Detalhar Exame

source: Exam of the disciplines that I am enrolled
pt: Exame das disciplinas que eu participo

source: Error
pt: Erro

source: Code between [[def: and ]] contains instructions not permitted
pt: O código entre [[def: e ]] contém instruções não permitidas

source: Report:
pt: Relatório:

source: Exams List
pt: Listar Exames

source: Create a New Exam
pt: Criar um novo Exame

source: Only teacher registered in a discipline and in a classroom
pt: Somente professores cadastrados em discipinas e em turmas

source: My Exams List
pt: Minha lista de Exames

source: No Class/Disc
pt: Sem Turma/Disc.

source: Message
pt: Mensagem

source: Exam Update
pt: Atualizar Exame

source: Attention
pt: ATENÇÃO

source: Each time you click Create-Variations, a different exam will be generated!
pt: Cada vez que você clicar em Criar-Variações, um exame diferente será gerado!

source: After printing the PDF with the exam, SAVE IT TO YOUR COMPUTER and
pt: Depois de imprimir o PDF com o exame, SALVAR NO COMPUTADOR e

source: DO NOT CHANGE the attributes of this page;
pt: NÃO MUDE os atributos desta página;

source: Otherwise automatic correction will not be possible on scanned exams in Upload-PDF.
pt: Caso contrário, a correção automática não será possível nos exames digitalizados em Upload-PDF.

source: Create-PDF
pt: Criar-PDF

source: video
pt: vídeo

source: Adjust PDF font size:
pt: Ajustar o tamanho da fonte do PDF:

source: Adjust font size: QRcode MUST be inside the 4 black discs
pt: Ajuste o tamanho da fonte: o QRcode DEVE estar dentro dos 4 disco pretos

source: Adaptive Exam
pt: Exame Adaptativo

source: Type of statistic:
pt: Tipo de estatística:

source: Weighted Probability of Correctness (WPC) is a method that enhances assessment by assigning weights to correct answers, taking into account the individual difficulty of each question. This difficulty is quantified by the ratio of the number of correct answers to the total corrections for that specific question.
pt: Weighted Probability of Correctness (WPC) ou A Porcentagem Ponderada de Acertos: Método que aprimora a avaliação atribuindo pesos às respostas corretas, levando em consideração a dificuldade individual de cada questão. Essa dificuldade é quantificada pela razão entre o número de respostas corretas e o total de correções específicas para aquela questão.

source: Maximum Likelihood Estimation (MLE) is a method used to determine the values of the parameters of a statistical model that maximize the likelihood of observing the data. This method dynamically adjusts the difficulty of the questions based on your previous responses, following the theory presented in Item Response Theory (IRT).
pt: Estimação de Máxima Verossimilhança (MLE) é um método usado para determinar os valores dos parâmetros de um modelo estatístico que maximizam a probabilidade de observar os dados. Esse método ajusta dinamicamente a dificuldade das questões com base nas suas respostas anteriores, seguindo a Teoria de Resposta ao Item (TRI).

source: Semi-Adaptive Testing by Bloom (SAT): Adaptive assessment method where the teacher manually sets the Bloom's Taxonomy level for each question. This method combines adaptability with personalized assessment, allowing the system to dynamically adjust the difficulty of questions based on students' answers in previous exams, while also considering cognitive levels pre-defined by the teacher.
pt: Semi-Adaptive Testing (SAT) ou Avaliação Semi-Adaptativa: Método de avaliação adaptativa em que o professor define manualmente o nível da Taxonomia de Bloom para cada questão. Este método combina adaptabilidade com avaliação personalizada, permitindo que o sistema ajuste dinamicamente a dificuldade das questões com base nas respostas dos alunos em exames anteriores, ao mesmo tempo em que considera os níveis cognitivos predefinidos pelo professor.

source: Number of Exams with QM:
pt: Número de Exames com QM:

source: Adaptive exam: consider X exams performed
pt: Exame adaptativo: considera X exames realizados
