Repository: fzampirolli/mctest
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt

source: Attendance offered to the community to facilitate the process of automatic elaboration and correction of the exams, with generation and correction of many exams.
pt: Serviço oferecido para a comunidade para facilitar o processo de elaboração e correção de exames, com geração e correção de muitos exames.

source: Dynamic content
pt: Conteúdo dinâmico

source: The MCTest has the following record counts
pt: O MCTest tem os seguintes contadores

source: see also:
pt: ver também

source: Institutes
pt: Institutos

source: Institute has Courses
pt: Instituto tem Cursos

source: Courses
pt: Cursos

source: Course has Disciplines
pt: Curso tem Disciplinas

source: Disciplines
pt: Disciplinas

source: Discipline has Topics and Classrooms
pt: Disciplina tem Tópicos, Turmas e Profs

source: Classroom has Exams, Profs and Student
pt: Turmas tem Exames, Profs e Estudantes

source: Exams
pt: Exames

source: Exam has Classrooms and Questions
pt: Exame tem Turmas e Questões

source: motivations
pt: motivações

source: Topic has Questions
pt: Tópico tem Questões

source: motivations for the use of bloom taxonomy
pt: motivações para o uso da taxonomia de bloom

source: Multiple Choice
pt: Múltipla Escolha

source: Text
pt: Dissertativa

source: Parametric
pt: Paramétrica

source: Users
pt: Usuários

source: Explanatory videos
pt: Vídeos explicativos

source: Research Project
pt: Projeto de Pesquisa

source: Title
pt: Título

source: History
pt: Histórico

source: Software registration
pt: Registro de software

source: Order
pt: Pedido

source: Developed in Python (Django 2.0) for automatic correction - available in
pt: Desenvolvido em Python (Django 2.0) para a correção automática - disponível em

source: exams generated in LaTeX using a MySQL DB
pt: exames gerados em LaTeX usando o BD MySQL

source: Developed in Python for LaTeX generated exams
pt: Desenvolvido em Python para exames gerados em Latex

source: Developed in Python for automatic correction - available in
pt: Desenvolvido em Python para a correção automática - disponível em

source: by ftp
pt: por ftp

source: Developed in Python for automatic correction - exams generated in Word / BROffic
pt: Desenvolvido em Python para a correção automática - exames gerados em Word/BROffice

source: Developed in Android
pt: Desenvolvido em Android

source: for automatic correction - exams generated in Word / BROffice
pt: para correção automática - exames gerados em Word/BROffice

source: Developed in Matlab for automatic correction - exams generated in Word / BROffice
pt: Desenvolvido em Matlab para a correção automática - exames gerados em Word/BROffice

source: Publications
pt: Publicações

source: For verification
pt: Para verificação

source: Last Login
pt: Último Acesso

source: You have visited this page
pt: Você visitou esta página

source: time
pt: vez

source: times
pt: vezes

source: Send improvement suggestions to
pt: Enviar sugestões de melhoria para

source: Options
pt: Ações

source: Commands
pt: Comandos

source: According
pt: De Acordo

source: MCTest (available for free on GitHub) was deployed on the UFABC server:
pt: O MCTest (disponível gratuitamente no GitHub) foi implantado no servidor da UFABC:

source: At UFABC, MCTest is a collaborative service for the automatic generation and correction of training activities (such as Exercise Lists) and assessment activities (such as Evidence Examples).
pt: Na UFABC, o MCTest é um serviço colaborativo para geração e correção automática de atividades de formação (como Listas de Exercícios) e de avaliação (como Provas).

source: This service is available free of charge to all professors at the UFABC.
pt: Esse serviço está disponível gratuitamente para todos os docentes da UFABC.

source: To use MCTest, the teacher must register on the platform and be enrolled in a discipline by its coordinator.
pt: Para poder utilizar o MCTest, o professor deve inscrever-se na plataforma e ser cadastrado em alguma disciplina pelo seu coordenador.

source: All intellectual material (classes, videos, questions, etc.) made available on this site is protected by the copyright of its respective authors and, ultimately, is the property of UFABC.
pt: Todo o material intelectual (aulas, vídeos, questões, etc.) disponível neste site está protegido pelo direito autoral dos seus respectivos autores e, em última instância, é propriedade da UFABC.

source: The authors who have the material available on the website agree to release its use without restrictions on the part of the institution's professors to whom they are linked only within the scope of the disciplines and courses of this institution. In addition, when I sign up for this service at this institution, I ACCEPT that:
pt: Os autores proprietários do material disponibilizado no site concordam em liberar o seu uso sem restrições pelos professores da instituição a qual está vinculado somente no âmbito das disciplinas e cursos desta instituição. Além disso, quando me inscrevo neste serviço, nesta instituição, CONCORDO que:

source: I can use for free all available questions already registered in the discipline in my exams;
pt: Posso utilizar livremente em meus exames todas as questões disponíveis já cadastradas na disciplina;

source: I cannot publish questions created by other teachers in any other medium, such as books and articles;
pt: Não posso publicar questões criadas por outros professores em quaisquer outras mídias, como por exemplo livros e artigos;

source: All new questions that I create can be reused in tests prepared by other teachers of the same subject, without prior notice;
pt: Todas as novas questões que eu criar podem ser reaproveitadas em provas elaboradas por outros professores da mesma disciplina, sem prévio aviso;

source: I can change other teachers' questions only if there is an error. However, without changing the authorship of the issue.
pt: Só posso mudar as questões dos outros professores SOMENTE SE HOUVER ALGUM ERRO. Porém, sem alterar a autoria da questão.

source: All institutes
pt: Institutos

source: All courses
pt: Cursos

source: All disciplines
pt: Disciplinas

source: All topics
pt: Tópicos

source: All questions
pt: Questões

source: All exams
pt: Exames

source: Logout
pt: Sair

source: Login
pt: Entrar

source: Sign up
pt: Inscrever

source: copy
pt: copiar

source: print
pt: imprimir

source: column visibility
pt: colunas visíveis

source: by
pt: por

source: from
pt: da

source: and
pt: e

source: individual contributors
pt: Colaboradores

source: Who use
pt: Quem utiliza

source: Book
pt: Livro

source: README
pt: LEIA-ME

source: Grant
pt: Apoio

source: Text comparison
pt: Comparação de Textos

source: Enter two texts to compare, with the same number of lines:
pt: Entre com dois textos, com o mesmo número de linhas:

source: Text compare
pt: Comparar textos

source: Text inverter
pt: Inverter textos

source: Number of differences =
pt: Número de diferenças =

source: Contributors
pt: Colaboradores

source: Thanks to many contributors who provided interesting information and are co-authors of the publications presented at
pt: Agradeço aos vários colaboradores que forneceram informações interessantes e são co-autores nas publicações apresentadas em

source: We also thank the contributors who helped codify MCTest, unknown in web discussion forums
pt: Agradeço também aos colaboradores que ajudaram a codificar o MCTest, desconhecidos nos fóruns de discussão na web

source: I think the big difference with MCTest is the parameterized issue, which may need custom Python functions to make writing easier. In this regard, I also thank
pt: Acho que a grande diferença do MCTest é a questão parametrizada, que pode precisar de funções personalizadas em Python para facilitar a escrita. A esse respeito, também agradeço

source: I hope this list grows more and more
pt: Espero que esta lista cresça mais e mais

source: Please email
pt: Enviar email para

source: if I forgot anyone
pt: se eu esqueci de alguém

source: in Portuguese
pt: Português

source: global vision
pt: Versão global

source: create Classrooms and Exams
pt: Criar Turmas e Exames

source: to correct Exams
pt: Corrigir Exames

source: to create questions using the TXT file
pt: Criar questões utilizando arquivo TXT

source: create parametric questions
pt: Criar Questões Paramétricas

source: part I
pt: parte I

source: part II
pt: parte II

source: part III
pt: parte III

source: use of the sympy library (URM and integral examples)
pt: usar a biblioteca sympy (exemplo com MRU e integral)

source: part IV
pt: parte IV

source: use of the sympy library (integral with figure and graph)
pt: usar a biblioteca sympy (integral com figura e grafo)

source: part V
pt: parte V

source: part VI
pt: parte VI

source: to create exams with multiple choice questions and dissertations - conclusions
pt: para criar exames com questões de múltipla escolha e dissertativas - conclusões

source: global vision (in English)
pt: Versão global (em Inglês)

source: Learn how to create classrooms, exams, and parametric questions step-by-step.
pt: Aprenda a criar turmas, exames e questões paramétricas passo a passo.

source: Watch on YouTube
pt: Assista no YouTube

source: Developed in Python (with Django) for automatic correction
pt: Desenvolvido em Python (com Django) para a correção automática

source: Developed in Python for automatic correction
pt: Desenvolvido em Python para a correção automática

source: Developed in Python
pt: Desenvolvido em Python

source: Developed in Matlab
pt: Desenvolvido em Matlab

source: Journal
pt: Revista

source: Best Paper
pt: Melhor Artigo

source: Honorable Mention
pt: Menção Honrosa

source: 2nd Place
pt: 2º Lugar

source: Access History
pt: Histórico

source: Never logged in
pt: Nunca fez login

source: License
pt: Licença

source: Welcome to MCTest, a website dedicated to assisting in exam preparation and grading.
pt: Bem-vindo ao MCTest, um site dedicado a auxiliar na preparação e correção de exames.

source: MCTest is free and open-source software (see
pt: MCTest é um software livre e de código aberto (veja

source: with its most notable feature being the ability to handle parametric questions using LaTeX and Python. This allows for numerous variations of the same question.
pt: com sua característica mais notável sendo a capacidade de lidar com questões paramétricas usando LaTeX e Python. Isso permite inúmeras variações da mesma questão.

source: Books
pt: Livros

source: Help us spread MCTest. The more people use it, the faster we can make improvements.
pt: Ajude-nos a divulgar o MCTest. Quanto mais pessoas o usarem, mais rápidas serão as melhorias.

source: Future Improvements
pt: Melhorias Futuras

source: Error messages and graphical interfaces
pt: Mensagens de erro e interfaces gráficas

source: Install
pt: Instalação

source: including other operating systems
pt: incluindo outros sistemas operacionais

source: The time to generate PDF from an exam with many students
pt: Tempo para criar pdf de um exame com muitos estudantes

source: Site and DB in different languages. For example, edit the
pt: Portal e BD em diferentes idiomas. Por exemplo, edit

source: for Portuguese and use the commands
pt: para Português e use os comandos

source: Afterwards make the following changes in
pt: Em seguida, faça as seguintes alterações em

source: Please see 'locale' folder for other languages
pt: Ver pasta 'locale' para outros idiomas

source: AI Exams Module: individual exams based on the students and the class history
pt: Módulo de Exame utilizando IA: exames individuais com base no histórico do aluno e da turma

source: AI Students Module: evaluation of how the weigh questions in order to show the skills and abilities of each student
pt: Módulo de Estudante utilizando IA: como as questões com diferentes pesos são escolhidas para mostrar as competências e habilidades de cada estudante

source: Use of blockchain to validate exams, history and other features
pt: Utilizar blockchain para validar exames, histórico e outros recursos

source: Inclusion of facial recognition in the QR Code of the exams
pt: Inclusão de reconhecimento facial no QR Code dos exames

source: Improve of Item Response Theory
pt: Melhoria da Teoria de Resposta ao Item

source: Use Markdown to describe questions and send exams or activities to students
pt: Usar Markdown para descrever questões e enviar exames ou atividades aos alunos

source: Adapt the Android application to this version of MCTest
pt: Adaptar o aplicativo Android a esta versão do MCTest

source: Study the integration of MCTest with other systems, for example, SIGAA and Moodle, sharing different databases
pt: Estudar a integração do MCTest com outros sistemas, por exemplo, SIGAA e Moodle, compartilhando bancos de dados diferentes

source: Run the parametric question codes on other servers, similar to those used in the Moodle VPL plug-in
pt: Executar os códigos de questões paramétricos em outros servidores, semelhante ao usado ​​no plug-in VPL do Moodle

source: Integrate with MakeTests
pt: Integrar com MakeTests

source: Write a complete tutorial to install and use MCTest
pt: Escrever um tutorial completo para instalar e usar o MCTest

source: I would like to collaborate with experts to write articles or technical reports
pt: Gostaria de colaborar com especialistas para escrever artigos ou relatórios técnicos

source: A maximum of 5 authors per article
pt: Máximo de 5 autores por artigo

source: Authors' order proportional to the number of pages written
pt: Ordem dos autores proporcional ao número de páginas escritas

source: I already have data/implementations for some topics
pt: Já tenho dados/implementações para alguns tópicos

source: Security in exams using QRcode
pt: Segurança em exames utilizando QRCode

source: Exams with multiple-choice questions and different weights in the answers
pt: Exames com questões de múltipla escolha e pesos diferentes nas respostas

source: Answer sheet design comparisons
pt: Comparações com diferentes folhas de respostas

source: A case study using Item Response Theory
pt: Um estudo de casos utilizando Teoria de Resposta ao Item

source: Individualized online activities with multiple-choice parametric questions
pt: Atividades online individualizadas com questões paramétricas de múltipla escolha

source: MCTest: Software Requirements Specification
pt: MCTest: Especificações de Requisitos de Software

source: MCTest: graphic interface
pt: MCTest: interfaces gráficas

source: MCTest: data base
pt: MCTest: banco de dados

source: MCTest: software architecture
pt: MCTest: arquitetura de software

source: MCTest: software deployment
pt: MCTest: implantação de software

source: Versions
pt: Versões

source: August 2018
pt: Agosto de 2018

source: Multiple choice test model in QR Code itself
pt: Os gabaritos das questões de múltipla-escolha estão no próprio QRCode

source: August 2019
pt: Agosto de 2019

source: New graphical interfaces
pt: Novas interfaces gráficas

source: The multiple-choice test template is now stored on the server
pt: Os gabaritos das questões de múltipla escolha estão armazenadas agora no servidor (por 180 dias)

source: Grant: #2018/23561-1, São Paulo Research Foundation:
pt: Processo n. 2018/23561-1, Fundação de Amparo à Pesquisa do Estado de São Paulo:

source: Title: A universal system for generation and correction automatic of parametrized questions
pt: Título: Um Sistema Universal para Geração e Correção Automática de Questões Parametrizadas

source: Questions with skills defined in
pt: Questões com habilidades definidas em

source: Trace Tables
pt: Teste de Mesa

source: Email-based hashing.
pt: Hashing baseado em e-mail.

source: Exams with topics and adaptive tests.
pt: Exames com tópicos e testes adaptativos.

source: for Moodle 4.1.
pt: para Moodle 4.1.

source: First Edition of the Book
pt: Primeira Edição do Livro

source: Currently in Progress
pt: Atualmente em Progresso

source: AI-based feedback
pt: Feedback baseado em IA

source: Main and Exam screens
pt: Telas Principal e de Exame

source: Version Control
pt: Controle de Versão

source: Fast switching on the Exam Screen between layouts v5.3 and v5.4
pt: Troca rápida na Tela de Exame entre os layouts v5.3 e v5.4

source: Organized Workflows
pt: Fluxos de Trabalho Organizados

source: Automatic selection on the Exam Screen
pt: Seleção automática na Tela de Exame

source: Security
pt: Segurança

source: Conflict validation and resolution
pt: Validação e resolução de conflitos

source: Second Edition of the Book (in construction)
pt: Segunda Edição do Livro (em construção)

source: Install MCTest
pt: Instalar MCTest

source: To install MCTest, follow the steps below:
pt: Para instalar o MCTest, siga os passos abaixo:

source: Install Ubuntu 24.04 on VirtualBox
pt: Instale o Ubuntu 24.04 no VirtualBox

source: In Ubuntu, run the following commands in the terminal:
pt: No Ubuntu, execute os seguintes comandos no terminal:

source: Change 'yourUsername' above before running the script.
pt: Altere 'yourUsername' acima antes de executar o script.

source: This will download the installation script and perform the necessary configurations.
pt: Isso fará o download do script de instalação e realizará as configurações necessárias.

source: Please wait for completion: After a few minutes, the process will be finished, and MCTest will be set up.
pt: Aguarde a conclusão: Após alguns minutos, o processo será finalizado e o MCTest estará configurado.

source: In the same terminal, run MCTest with the following command, changing 'yourUsername':
pt: No mesmo terminal, execute o MCTest com o seguinte comando, alterando 'yourUsername':

source: Access MCTest: After completion, open a web browser with the URL
pt: Acessar o MCTest: Após a conclusão, abra um navegador web com a URL

source: For new terminals, run MCTest with the following commands, changing 'yourUsername':
pt: Para novos terminais, execute o MCTest com os seguintes comandos, alterando 'yourUsername':

source: For more details and configuration options, refer to the
pt: Para mais detalhes e opções de configuração, consulte o arquivo

source: Only teachers can register for this service.
pt: Somente professores podem se inscrever neste serviço.

source: It is necessary to use the institutional email, as stated in the institution's registration.
pt: É necessário utilizar o e-mail institucional, conforme informado no cadastro da instituição.

source: For example, user@ufabc.edu.br is valid, while user@aluno.ufabc.edu.br is invalid.
pt: Por exemplo, user@ufabc.edu.br é válido, enquanto user@aluno.ufabc.edu.br é inválido.

source: Federal University of ABC
pt: Universidade Federal do ABC

source: English
pt: Inglês

source: Portugues
pt: Português

source: Student ID
pt: ID do Estudante

source: name
pt: nome

source: Student Name
pt: Nome do Estudante

source: Student Email
pt: Email do Estudante

source: Delete Student
pt: Apagar Estudante

source: Are you sure you want to delete the student from classroom
pt: Tem certeza que deseja abagar este estudante da turma

source: Only prof can update/create/delete student
pt: Somente prof pode criar/atualizar/apagar estudante

source: Only prof/coord can update/create/delete students
pt: Somente prof pode criar/atualizar/apagar estudantes

source: Only admin can update/create/delete students
pt: Somente admin pode criar/atualizar/apagar estudantes

source: Student Detail
pt: Detalhar Estudante

source: Student Update
pt: Atualizar Estudante

source: StudentUpdate: There is already student(s) with ID
pt: StudentUpdate: Já existe estudante com ID

source: StudentCreate: There is already student(s) with ID
pt: StudentCreate: Já existe estudante com ID

source: Logged out!
pt: Sair

source: Click here to login again
pt: Clique aqui para logar novamente

source: Your username and password didn't match. Please try again
pt: Username e Senha não conferem. Tente novamente

source: Your account doesn't have access to this page. To proceed, please login with an account that has access
pt: Sua conta não tem acesso a esta página. Para continuar, faça login com uma conta que tenha acesso

source: Please login to see this page
pt: Entrar para ver esta página

source: Lost password?
pt: Perdeu a senha?

source: Reset password
pt: Recuperar senha

source: The password has been changed!
pt: A senha foi alterada!

source: Log in again?
pt: Entrar novamente?

source: Please enter (and confirm) your new password
pt: Entrar (e confirmar) sua nova senha

source: New password
pt: Nova senha

source: Confirm password
pt: Confirmar senha

source: Change my password
pt: Mudar minha senha

source: Password reset failed
pt: Falhou recuperar senha

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
pt: O link de redefinição de senha é inválido, possivelmente porque já foi usado. Solicite uma nova redefinição de senha.

source: We've emailed you instructions for setting your password. If they haven't arrived in a few minutes, check your spam folder.
pt: Enviamos instruções por e-mail para definir sua senha. Se não chegar em alguns minutos, verifique sua pasta de spam.

source: ImportQuestions: Question without answers:
pt: ImportQuestions: ERRO - questão sem respostas:

source: Total of questions without groups:
pt: Total de questões sem grupos:

source: Easy questions QE:
pt: Questão com nível fácil:

source: Mean questions QM:
pt: Questões com nível médio:

source: Hard questions QH:
pt: Questões com nível difícil:

source: Text questions QT:
pt: Questões Dissertativas:

source: Total of questions with groups:
pt: Total de questões com grupos:

source: Short Description
pt: Descrição curta

source: Only one question per group will be sorted for each exam
pt: Somente uma questão por grupo será sorteada para cada exame

source: Description (you can include latex format)
pt: Descrição (você pode incluir fomato latex)

source: Difficulty
pt: Dificuldade

source: Bloom Taxonomy
pt: Taxonomia de Bloom

source: Question with some randomly chosen values
pt: Questões com algum valores escolhidos aleatoriamente

source: Parametric question
pt: Questão Paramétrica

source: Who Created
pt: Quem criou

source: Last Update
pt: Última atualização

source: Correction Count
pt: Contador de Correções

source: Correct Count
pt: Contador de Corretas

source: Discrimination
pt: Discriminação

source: Ability
pt: Habilidade

source: Guessing
pt: Chute

source: Choose a discipline for this topic.
pt: Escolha uma disciplina para este tópico

source: Tip: Include a prefix in the topic, such as discipline code.
pt: Dica: Incluir um prefixo no tópico, como um código de disciplina.

source: Only one question per group will be sorted for each exam (student)
pt: Somente uma questão por grupo será sorteada para cada exame (e para cada estudante)

source: Question Group
pt: Grupo de Questões

source: Enter a short description
pt: Descrição curta

source: Multiple-Choice Question
pt: Questões de Múltipla Escolha

source: Text Question
pt: Questões Dissertativas

source: Very easy level question
pt: Questão com nível muito fácil

source: Easy level question
pt: Questão com nível fácil

source: Mid-level question
pt: Questão com nível médio

source: Difficult level question
pt: Questão com nível difícil

source: Very Difficult level question
pt: Questão com nível muito difícil

source: remember: recognizing, recalling
pt: lembre-se: reconhecendo, lembrando

source: understand: interpreting, exemplifying, classifying, comparing
pt: entender: interpretar, exemplificar, classificar, comparar

source: apply: executing, implementing
pt: aplicar: executando, implementando

source: analyze: differentiating, organizing, attibuting
pt: analisar: diferenciando, organizando, atribuindo
