Repository: fzampirolli/mctest
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt

source: evaluate: checking, critiquing
pt: avaliar: checando, criticando

source: create: generating, planning, producing
pt: criar: gerando, planejando, produzindo

source: Answer Text
pt: Texto da Resposta

source: Answer Feedback
pt: Retorno desta alternativa

source: Delete Question
pt: Apagar Questão

source: Are you sure you want to delete the question
pt: Tem certeza que deseja apagar esta questão

source: ERROR: You did not create this question or you are not the course coordinator. Please get in touch with them.
pt: ERRO: Você não criou esta questão ou não é o coordenador do curso. Por favor, entre em contato com eles para alterar algo nesta questão.

source: Questions of the disciplines that I am enrolled
pt: Questões das disciplinas em que participo

source: Create a new Question
pt: Criar uma nova Questão

source: Choose Topic
pt: Escolher Tópico

source: Difficult
pt: Dificuldade

source: Click in Update Question in My Questions to create the answers
pt: Clique em Atualizar Questão em Minhas Questões para criar alternativas.

source: Question Detail
pt: Detalhar Questão

source: Answer
pt: Alternativa

source: Feedback
pt: Retorno

source: Question List
pt: Listar Questões

source: Select a Discipline to view questions
pt: Selecione uma Disciplina para visualizar as questões

source: --- Choose a Discipline ---
pt: --- Escolher uma Disciplina ---

source: No questions found for the selected Discipline.
pt: Nenhuma questão encontrada para a Disciplina selecionada.

source: Please select a Discipline above to view questions.
pt: Por favor, selecione uma Disciplina acima para visualizar as questões.

source: This ensures faster loading times.
pt: Isso garante um carregamento mais rápido.

source: My Questions List
pt: Minha Lista de Questões

source: Create a New Question
pt: Criar uma nova Questão

source: Please select a Discipline above to view your questions.
pt: Por favor, selecione uma Disciplina acima para visualizar suas questões.

source: Import from TXT (MCTest4 format)
pt: Importar questões de um arquivo TXT (formato MCTest4)

source: Choose TXT file
pt: Escolher arquivo TXT

source: UTF-8 or Latin-1
pt: Somente formato UTF-8 ou Latin-1

source: CRITICAL ERROR:
pt: ERRO CRÍTICO

source: The TOPIC (e.g., '7-matrix') used in the file MUST exist in the system and belong to your Discipline.
pt: O TÓPICO (ex: '7-matriz') usado no arquivo DEVE existir no sistema e pertencer à sua Disciplina.

source: Standard Syntax
pt: Sintaxe Padrão

source: Parametric Syntax
pt: Sintaxe Paramétrica

source: 1 Question per File
pt: 1 Questão por Arquivo

source: IMPORTANT: After importing, verify if the 'Parametric' attribute is set to 'YES' in the question details.
pt: IMPORTANTE: Após importar, verifique se o atributo 'Paramétrica' está definido como 'SIM' nos detalhes da questão.

source: Import from JSON
pt: Importar de JSON

source: Choose JSON file
pt: Escolher arquivo JSON

source: Upload-Questions-Json
pt: Upload-Questões-Json

source: Download a question to view the Json format
pt: Download uma questão antes para ver o formato Json

source: Question Update
pt: Atualizar Questão

source: See this question in PDF format
pt: Ver esta questão no formato PDF

source: Compile-Colab
pt: Compilador-Colab

source: Copy-Paste the description of question for test in Colab Google
pt: Copie-Cole a descrição da questão para testar no Colab do Google

source: Save-Json
pt: Salva-Json

source: It will save all your questions to a file in json format
pt: Salvar questões de um arquivo (formato Json)

source: Does not work for LaTeX snippets
pt: Não funciona para trechos LaTeX

source: spell check
pt: corretor

source: Multiple Choice Question (QM) Statistics: Corrections, Accuracy (Correct/Correction), and IRT
pt: Estatísticas de questões de múltipla escolha (QM): correções, precisão (corretas/correções) e TRI

source: IRT:
pt: TRI:

source: Discrimination (a)
pt: Discriminação (a)

source: Ability (b)
pt: Habilidade (b)

source: Guessing (c)
pt: Chute (c)

source: For details, see Appendix B of the book (2nd Edition - Under Construction)
pt: Para detalhes, ver Apêndice B do livro (segunda edição em construção)

source: To test these values (a, b, c), see Google Colab
pt: Para testar esses valores (a, b, c), ver Google Colab

source: Duplicate This Question
pt: Duplicar esta Questão

source: Choose a PNG file for import.
pt: Escolha um arquivo PNG para importação.

source: Be cautious with the file name to avoid overwriting another file with the same name.
pt: Tenha cuidado com o nome do arquivo para evitar sobrescrever outro arquivo com o mesmo nome.

source: One suggestion is to include a prefix in the file name like
pt: Uma sugestão é incluir um prefixo no nome do arquivo, como

source: Do not include special characters and spaces in the file name.
pt: Não inclua caracteres especiais e espaços no nome do arquivo.

source: This file will be retained for 180 days in server.
pt: Este arquivo será mantido por 180 dias no servidor.

source: Remember that images in LaTeX make PDF generation extremely slow!
pt: Lembre-se de que as imagens em LaTeX tornam a geração do PDF extremamente lenta!

source: See below how to include this image in a question.
pt: Veja abaixo como incluir esta imagem em uma questão.

source: Delete this Question
pt: Apagar esta Questão

source: Delete Topic
pt: Apagar Tópico

source: Are you sure you want to delete the topic
pt: Tem certeza que deseja abagar este tópico

source: Note that you will delete a topic that belongs to more than one discipline!
pt: Note que você irá apagar um tópico que pertence a mais de uma disciplina!

source: All questions connected this topic will be removed from the database!
pt: Todas as questões conectadas a este tópico serão removidas do banco de dados!

source: Create a new Topic
pt: Criar um novo Tópico

source: Important: Use the abbreviated name in Topic and represent the content of the Discipline.
pt: Importante: usar nome curto que represente o tópico da disciplina

source: Only coordenate registered in a discipline
pt: Somente coordenador cadastrado em disciplinas

source: Topic Detail
pt: Detalhar Tópico

source: View all questions in this topic in PDF format, sorted by similarity
pt: Ver todas as questões deste tópico em formato PDF, classificadas por similaridade

source: Question
pt: Questão

source: Note: For each exam, only one question is taken from each group
pt: Importante: para cada exame, somente uma questão é escolhida de cada grupo

source: Only the teacher registered in the course can see more details
pt: Somente professores cadastrados em curso pode ver mais detalhes

source: Topics of the disciplines that I am enrolled
pt: Tópicos das disciplinas que eu participo

source: Only coordinator can create/update/delate topics
pt: Somente coordenandor pode criar/atualizar tópicos

source: Topic Update
pt: Atualizar Tópico

source: Error writing temporary .tex file: {e}
pt: Erro ao escrever arquivo .tex temporário: {e}

source: Error in LaTeX Log (Cmd: {self.pdflatex_cmd}): {log_output}
pt: Erro no Log do LaTeX (Cmd: {self.pdflatex_cmd}): {log_output}

source: Subprocess exception: {e}
pt: Exceção do subprocesso: {e}

source: Error moving file to final destination: {e}
pt: Erro ao mover arquivo para o destino final: {e}

source: UtilsMC.questionParametric: forbidden words found.
pt: UtilsMC.questionParametric: palavras proibidas encontradas.

source: The question has been successfully duplicated! You can <a href="../../{}/update/">view and edit the duplicated question here</a>.
pt: A questão foi duplicada com sucesso! Você pode <a href="../../{}/update/">ver e editar a questão duplicada aqui</a>.

source: JSON file is empty.
pt: O arquivo JSON está vazio.

source: Questions Created Successfully:
pt: Questões Criadas com Sucesso:

source: Skipped similar question(s) already in DB:
pt: Ignoradas questão(ões) similar(es) já existentes no BD:

source: No questions were processed or permissions denied.
pt: Nenhuma questão foi processada ou permissão negada.

source: ImportQuestions: choose a TXT file following the model!
pt: ImportQuestions: escolha um arquivo TXT seguindo o modelo!

source: No questions found or invalid format.
pt: Nenhuma questão encontrada ou formato inválido.

source: ImportQuestions: Teacher is not associated with any discipline for topic:
pt: ImportQuestions: O professor não está associado a nenhuma disciplina para o tópico:

source: ImportQuestions: Topic does not exist (Create it first):
pt: ImportQuestions: O tópico não existe (Crie-o primeiro):

source: No questions were processed.
pt: Nenhuma questão foi processada.

source: ImportQuestionsImage: choose a PNG following the model!
pt: ImportQuestions: escolher um arquivo PNG seguindo o exemplo

source: Image imported successfully!
pt: Imagem importada com sucesso!

source: A topic with the same text already exists. Please consider using a unique name. Suggested name: {}
pt: Já existe um tópico com o mesmo texto. Considere usar um nome exclusivo. Nome sugerido: {}

source: TopicCreate: the user isn't the coordinator of the discipline
pt: TopicCreate: o usuário não é um coordenador da disciplina

source: UtilsMC.questionParametric: do not use some words in the code, for ex. exec, cmd, open, import os, remove, mkdir, sys, gnureadline, subprocess, getopt, shlex, wget, commands, system, exec, eval
pt: UtilsMC.questionParametric: não use paralavras reservadas, por exemplo: exec, cmd, open, import os, remove, mkdir, sys, gnureadline, subprocess, getopt, shlex, wget, commands, system, exec, eval

source: ERROR IN THE PARAMETRIC PART!!!
pt: ERRO NA PARTE PARAMÉTRICA

source: The professor does not have permission!
pt: O professor não tem permissão

source: ERROR: The teacher is not registered in the Discipline (of the topic)
pt: ExamUpdate: o professor não está registrado na disciplina

source: QuestionCreate: the teacher is not registered in discipline
pt: QuestionCreate: o professor não está registrado na disciplina
