Repository: fzampirolli/mctest
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt

source: Caution: (1) Choose A4 sheet with good toner. (2) For multiple-choice exams, if the circles are defective, the broker may not work correctly - we recommend that you change the printer and print again. (3) Before applying the exam, it is strongly recommended to print a sheet, fill in, scan and follow the step on the right side. Upload-PDF >>>
pt: Atenção: (1) Escolher folha A4 com toner bom. (2) Para exames de múltipla escolha, se tiver falhas nos círculos o corretor poderá não funcionar corretamente - é recomendável mudar de impressora e imprimir novamente. (3) Antes de aplicar o exame, recomenda-se fortemente imprimir uma folha, preencher, digitalizar e seguir o passo ao lado direito Upload-PDF >>>

source: Increase the contrast? Useful if the PDF is too white!
pt: Aumentar o contraste? Útil se o PDF estiver muito branco!

source: Choose PDF file for correction of exams
pt: Escolher arquivo PDF para correções dos exames

source: If you choose to provide feedback to the students, also send the questions and the answer keys.
pt: Caso opte por dar feedback aos alunos, envie também as questões e os gabaritos.

source: Caution: (1) Before scanning, make sure all circles have been filled correctly. If you to use correction fluid and erase part of the outline of the circle, the correction may not work. (2) Scan with a resolution of 150dpi (if you can not decode QRCode, use 200dpi), <code>gray levels</code>, just the front of the sheet and one PDF per class. (3) The 4 black disks can not be defective. (4) If you chose only answers on the screen of this exam, the first page of the PDF should contain the template and all questions will be disregarded. (5) If in this Exam screen the option to Return to Students was chosen, when enrolling the students in the class, you must also include the student's e-mail. If this has been done, you can follow the step to the right side Send-Return-Students, for each student receive the correction of your examination by email >>>
pt: Atenção: (1) antes de digitalizar, verificar se todos os círculos foram preenchidos corretamente. Se passar branquinho e apagar parte do contorno do círculo, o corretor poderá não funcionar. (2) Digitalizar com resolução de 150dpi (se falhar na decodificação do qrcode, usar 200dpi), <code>EM NÍVEIS DE CINZA</code>, somente a página de frente e um PDF por turma. (3) Os 4 discos pretos não podem estar com falhas. (4) Se foi escolhido apenas Respostas nesta tela de Exame, a primeira página do PDF deverá conter o gabarito e serão desconsideradas todas as questões. (5) Se nesta tela de Exame foi escolhido a opção de Retorno aos Alunos, ao cadastrar os alunos na turma, terá que incluir também o email do aluno. Se isso foi feito, poderá seguir o passo ao lado direito Enviar-Retornos-Estudantes, para cada aluno receber a correção do seu exame por email >>>

source: Send-Feedback-Students Text
pt: Enviar-Retornos-Estudantes Questões dissertativas

source: Caution: If you used exams with written questions and in non-ecological format, then one question was generated per sheet, right? If you want to submit manually corrections to each student's in PDFs, you will need to follow a few steps: (1) in the previous column step, when uploading all exams in PDF, a zip file with a folder for each question was generated (for example, Download.zip). Within this folder a pdf was generated for each student in the format _e1_c2_q3_p001_5.pdf, where 1 is the exam ID, 2 is the classroom ID, 3 is the question ID, 001 is the pdf page, and 5 is the student ID. The teacher can correct by making annotations in the PDF itself OR also can scan with annotations made in the pen. (2) manually change the file names of each question in the format _A;e1,e2,...;_e1_c2_q3_p001_5.pdf, where A is a concept or a note and ei are error code numbers (optional); in the question folder, it should have a _e1_c2_q3.txt file (<code>one for each classroom</code>), with a message to be sent to each student. (3) compress the folder of each question for all students (for example _e1_q3.zip) and press the button above. Each student will receive the PDF with the corrections and will also return a CSV file with the concepts of each student.
pt: Atenção: Se foi utilizado exames com questões dissertativas e no formato NÃO ecológico, então foi gerado uma questão por folha, certo? Se quiser enviar as correções feitas manualmente nos PDF's para cada estudante, então será necessário seguir alguns passos: (1) no passo da coluna anterior, ao fazer upload de todas os exames digitalizados, foi gerado um arquivo zip com uma pasta para cada questão (ex. Download.zip). Dentro desta pasta foi gerado um pdf para cada estudante no formato _e1_c2_q3_p001_5.pdf, onde 1 é o ID do exame, 2 é o ID da turma, 3 é o ID da questão, 001 é a página e 5 é o ID do estudante. O professor pode corrigir fazendo anostações no próprio PDF OU pode também digitalizar com anotações feitas à caneta. (2) alterar manualmente os nomes dos arquivos de cada questão da forma _A;e1,e2,...;_e1_c2_q3_p001_5.pdf, onde A é um conceito ou nota e ei são números de códigos de erros (opcional); na pasta da questão, tem que ter um arquivo _e1_c2_q3.txt (<code>um para cada turma</code>), com uma mensagem a ser enviada para cada estudante. (3) compactar a pasta de cada questão (ex. _e1_q3.zip) e fazer upload no botão acima. Será enviado para cada estudante o PDF com as correções e também irá retornar um arquivo CSV com os conceitos de cada estudante.

source: Send-Feedback-Students
pt: Enviar-Retornos-Estudantes

source: This option is to send feedback ONLY from multiple choice exams after successfully completing the step from the previous column.
pt: Esta opção é para enviar feedback APENAS dos exames de múltipla-escolha, após ter realizado o passo da coluna anterior com sucesso.

source: Before creating the exams in the button above, first create the variations. It is necessary to create new variations of the exam each time you change the questions and the number of variations in the attributes below.
pt: Antes de criar os exames no botão acima, primeiro crie as variações. É necessário criar novas variações do exame cada vez que você muda as questões e o número de variações nos atributos abaixo.

source: The options marked below will be sent to your email.
pt: As opções marcadas abaixo serão enviadas para o seu e-mail.

source: Create-Variations
pt: Criar-Variações

source: Topics List
pt: Listar Tópicos

source: Questions List
pt: Listar Questões

source: Group
pt: Grupo

source: Number of [GROUP, if defined or] Questions per Exam
pt: Número de [GRUPOS, se definido ou] Questões por Exame

source: Exam Style
pt: Estilo do Exame

source: Delete this Exam
pt: Apagar este Exame

source: Created by
pt: Quem criou

source: version
pt: versão

source: Save Changes
pt: Salvar Mudanças

source: Flow Type
pt: Tipo de Fluxo

source: Flow 1
pt: Fluxo 1

source: Flow 2
pt: Fluxo 2

source: Flow 3
pt: Fluxo 3

source: Font Size in PDF
pt: Tamanho da fonte no PDF

source: Student Feedback Configuration
pt: Configuração do Feedback do Estudante

source: Defines if/how students will receive their corrected exams and scores automatically via email.
pt: Define se/como os estudantes receberão seus exames corrigidos e notas automaticamente por e-mail.

source: General Instructions
pt: Instruções Gerais

source: Flows 2 and 3
pt: Fluxos 2 e 3

source: Before printing
pt: Antes de imprimir

source: Before scanning
pt: Antes de digitalizar

source: Caution: (1) Before scanning, make sure all circles have been filled correctly. If you to use correction fluid and erase part of the outline of the circle, the correction may not work. (2) Scan with a resolution of 150dpi (if you can not decode QRCode, use 200dpi), <code>gray levels</code>, just the front of the sheet and one PDF per class. (3) The 4 black disks can not be defective.
pt: Atenção: (1) Antes de digitalizar, certifique-se de que todos os círculos foram preenchidos corretamente. Se usar corretivo e apagar parte do contorno do círculo, a correção pode não funcionar. (2) Digitalize com resolução de 150dpi (se não conseguir decodificar o QRCode, use 200dpi), <code>níveis de cinza</code>, apenas a frente da folha e um PDF por turma. (3) Os 4 discos pretos não podem estar defeituosos.

source: Flow 1 [Answersheets]: Answer Sheet Only
pt: Fluxo 1 [Folhas de Resposta]: Apenas Folha de Respostas

source: STEP 1: Create-PDF
pt: PASSO 1: Create-PDF

source: Choose PDF with answer sheet only. Questions will not be generated by MCTest.
pt: Escolha o PDF apenas com a folha de respostas. As questões não serão geradas pelo MCTest.

source: STEP 2: Upload-PDF
pt: PASSO 2: Upload-PDF

source: If you select only the answer sheet in this exam (Flow 1), the first page of the PDF must contain the answer template.
pt: Se você selecionar apenas a folha de respostas neste exame (Fluxo 1), a primeira página do PDF deve conter o gabarito.

source: If you choose to provide feedback to students, also include an image of the answer sheet with the marked responses and the answer key.
pt: Se você optar por fornecer feedback aos alunos, incluir também uma imagem da folha de respostas com as respostas marcadas e o gabarito.

source: These changes will only take effect after clicking the Save button and then uploading the PDF.
pt: Essas alterações só entrarão em vigor após clicar no botão Salvar e depois fazer o upload do PDF.

source: Flow 2 [Both]: Answer Sheet + Questions
pt: Fluxo 2 [Ambos]: Folha de Respostas + Questões

source: STEP 1: Create-Variations
pt: PASSO 1: Create-Variations

source: This exam is mainly intended for answer sheets and multiple-choice questions (QM), and may include open-ended questions (QT).
pt: Este exame destina-se principalmente a folhas de respostas e questões de múltipla escolha (QM), podendo incluir questões dissertativas (QT).

source: Before Step 3, you must create the exam variations and save them in the database.
pt: Antes do Passo 3, você deve criar as variações do exame e salvá-las no banco de dados.

source: Only the most recently saved variations are used.
pt: Apenas as variações salvas mais recentemente são utilizadas.

source: The variation ID below must match the ID printed in the PDF for automatic correction to work.
pt: O ID da variação abaixo deve corresponder ao ID impresso no PDF para que a correção automática funcione.

source: Create new variations whenever you change the questions or the number of variations.
pt: Crie novas variações sempre que alterar as questões ou o número de variações.

source: Email Attachments Options
pt: Opções de Anexos de E-mail

source: Answer Key
pt: Texto da Resposta

source: Source + PDF
pt: Fonte + PDF

source: STEP 2: Create-PDF
pt: PASSO 2: Create-PDF

source: If you select Both in this exam (Flow 2), you must choose the questions. The exam will include both the answer sheet and the questions.
pt: Se você selecionar Ambos neste exame (Fluxo 2), deve escolher as questões. O exame incluirá tanto a folha de respostas quanto as questões.

source: These changes will only take effect after clicking the Save button and then Create-PDF.
pt: Essas alterações só entrarão em vigor após clicar no botão Salvar e, em seguida, em Criar-PDF.

source: Semi-Adaptive Testing by Bloom (SAT): Adaptive assessment method where the teacher manually sets the Bloom\
pt: Teste Semi-Adaptativo por Bloom (SAT): Método de avaliação adaptativa onde o professor define manualmente o Bloom

source: Move the mouse over the items above to view details about adaptive exams.
pt: Passe o mouse sobre os itens acima para ver detalhes sobre exames adaptativos.

source: STEP 3: Upload-PDF
pt: PASSO 3: Upload-PDF

source: If the 'Return to Students' option is enabled, students must have their email registered when enrolling in the course.
pt: Se a opção 'Retorno aos Alunos' estiver ativada, os alunos devem ter seu e-mail cadastrado ao se matricular no curso.

source: You can then use the 'Upload-PDF' step to email each student the corrected exam, including the marked answer sheet and the answer key.
pt: Você pode então usar a etapa 'Upload-PDF' para enviar por e-mail a cada aluno o exame corrigido, incluindo a folha de respostas marcada e o gabarito.

source: To also include the question text in the feedback, select the option above.
pt: Para incluir também o texto da questão no feedback, selecione a opção acima.

source: Flow 3 [Questions]: Written Questions Only (Manual Correction or VPL+Moodle)
pt: Fluxo 3 [Questões]: Apenas Questões Dissertativas (Correção Manual ou VPL+Moodle)

source: This exam (Flow 3) is intended for open-ended questions (QT).
pt: Este exame (Fluxo 3) destina-se a questões dissertativas (QT).

source: For written questions in non-ecological format, one question is generated per page. For use with VPL+Moodle, generate the questions in the appropriate format.
pt: Para questões dissertativas em formato não ecológico, uma questão é gerada por página. Para uso com VPL+Moodle, gere as questões no formato apropriado.

source: For details about integration with VPL/Moodle:
pt: Para detalhes sobre a integração com VPL/Moodle:

source: When uploading exams in PDF, a zip file will be generated with a folder for each question. Inside this folder a PDF will be generated for each student.
pt: Ao fazer o upload de exames em PDF, será gerado um arquivo zip com uma pasta para cada questão. Dentro desta pasta, um PDF será gerado para cada aluno.

source: STEP 4: Send-Feedback-Students Text
pt: PASSO 4: Enviar-Retorno-Estudantes Texto

source: Send Feedback
pt: Enviar Retorno

source: Steps 3 and 4 are detailed in the article:
pt: Os passos 3 e 4 estão detalhados no artigo:

source: Exam Attributes
pt: Atributos do Exame

source: Instructions printed on Exam
pt: Instruções impressas no Exame

source: Delete Exam?
pt: Apagar Exame?

source: Are you sure you want to delete this exam?
pt: Tem certeza que deseja apagar este exame?

source: This action cannot be undone.
pt: Esta ação não pode ser desfeita.

source: Yes, Delete
pt: Sim, Apagar

source: variationsExam: there are no variations in the answer-only style!
pt: variationsExam: não há variações no estilo: somente resposta!

source: Error sending email with variations.
pt: Erro ao enviar e-mail com as variações.

source: Exam variations were stored in the database.
pt: As variações do exame foram armazenadas no banco de dados.

source: Return and refresh the exam page. Notice the ID change next to the Create-Variations button.
pt: Retorne e atualize a página do exame. Observe a mudança de ID ao lado do botão Create-Variations.

source: Whenever you click this button, new exam variations will be stored in the database!
pt: Sempre que você clicar neste botão, novas variações do exame serão armazenadas no banco de dados!

source: Selected files have been sent to your email.
pt: Os arquivos selecionados foram enviados para o seu e-mail.

source: feedbackStudentsExamText: feedback to student is NO, Change to YES and click in Upload-PDF again!
pt: feedbackStudentsExamText: retorno do estudante é NÃO, escolher SIM e clique em Upload-PDF novamente

source: feedbackStudentsExamText: choose a ZIP file with scanned exams, for example _e31_769.zip!
pt: feedbackStudentsExamText: escolher um arquivo ZIP com os exames digitalizados, por exemplo: _e31_769.zip!

source: feedbackStudentsExamText: name of the pdf file does not follow a pattern ID_xxx.pdf
pt: feedbackStudentsExamText: nome do arquivo PDF não segue um padrão: ID_xxx.pdf

source: feedbackStudentsExamText: no email was sent, are you in the correct Exam and Term?
pt: feedbackStudentsExamText: nenhum email foi enviado, você está em Exame e Turma corretos?

source: feedbackStudentsExam: feedback to student is NO, Change to YES and click in Upload-PDF again!
pt: feedbackStudentsExam: retorno ao estudante é NÃO, escolher SIM e clique em Upload-PDF novamente!

source: feedbackStudentsExam: no email was sent, are you in the correct Exam and Term?
pt: feedbackStudentsExam: nenhum email foi enviado, você está em Exame e Turma corretos?

source: correctStudentsExam: choose a PDF file with scanned exams!
pt: correctStudentsExam: escolher um arquivo PDF com exames digitalizados

source: correctStudentsExam: Error in read PDF file:
pt: correctStudentsExam: erro ao ler PDF

source: Error reading QRcode from PDF for exam ID:
pt: Erro ao ler QRcode do PDF para o ID do exame:

source: correctStudentsExam: Error in IRT or more Statists
pt: correctStudentsExam: erro na TRI ou em mais estatísticas

source: correctStudentsExam: Error in MLE by scipy.optimize
pt: correctStudentsExam: Erro no MLE pelo scipy.optimize

source: correctStudentsExam: Error in IRT
pt: correctStudentsExam: erro na TRI

source: Create variations first
pt: Criar primeiro as variações

source: ERROR in generate_page, number_of_questions_text!!!!
pt: ERRO em generate_page, number_of_questions_text!!!!

source: ERROR in generate_page, number_of_QM!!!! - no questions:
pt: ERRO em generate_page, number_of_QM!!! - sem questões:

source: ERROR in generate_page, class with zero students:
pt: ERRO: classe com zero estudantes:

source: ERROR in Utils.distro_table, student:
pt: ERRO em Utils.distro_table, estudante:

source: ERROR in distro_table!!!! - student name:
pt: ERRO em distro_table!!!! - nome do estudante:

source: ERROR in validateNumQuestions!!!!
pt: ERRO em validateNumQuestions

source: ERROR generating PDF for student
pt: ERRO ao gerar PDF para estudante

source: ERROR generating PDF for class
pt: ERRO ao gerar PDF para a turma

source: ERROR: PDF file not found.
pt: ERRO: Arquivo PDF não encontrado.

source: ERROR: Zip file not created.
pt: ERRO: Arquivo Zip não criado.

source: ERROR - watch out for special characters in exam name
pt: ERRO - cuidado com os caracteres especiais no nome do exame

source: ExamListView: The teacher is not registered in a Discipline
pt: ExamListView: o professor não está registrado na disciplina

source: ExamUpdate: The teacher is not registered in a Discipline
pt: ExamUpdate: o professor não está registrado na disciplina

source: ExamDetailView: The teacher is not registered in a Discipline
pt: ExamDetailView: o professor não está registrado na disciplina

source: LaTeX Command
pt: Comando LaTeX

source: A simple question with latex command
pt: Uma simples questão com comando LaTeX

source: After clicking Create-PDF, see the next slide
pt: Após clicar em Criar-PDF, ver próximo slide

source: The formulas between $ from the previous slide are presented differently
pt: As fórmulas entre $ do slide anterior são apresentadas de maneira diferente

source: Adding an image that is on the web
pt: Adicionando uma imagem que está na web

source: Question with image to display on exam
pt: Questão com a imagem a ser exibida no exame

source: Exam only with answers (in the correction, the template is the first page of the PDF)
pt: Exame apenas com respostas (na correção, o gabarito é a primeira página do PDF)

source: Exam Style - Vertical
pt: Estilo do Exame - Vertical

source: Q&A (the correct answer can be found with '#0' in the PDF, details in yellow)
pt: Questões e respostas (a resposta correta pode ser encontrada fazendo uma busca no PDF por '#0', detalhes em amarelo)

source: Parametric Question - Part I
pt: Questão Paramétrica - Parte I

source: In the description, we have python code between '[[code:' and ']]' - to '[[def:
pt: Na descrição, temos códigos python entre '[[code:' e ']]' - também entre '[[def:' e ']]'

source: Parametric Question - Part II
pt: Questão Paramétrica - Parte II

source: Attributes and answers to a question. When creating a question, the first alternative is always the correct one
pt: Atributos e respostas de uma questão. Ao criar uma questão, a primeira alternativa é sempre a correta

source: Parametric Question - Part III
pt: Questão Paramétrica - Parte III

source: Question to be displayed. Note the order in which answers were drawn after '#'
pt: Questão a ser exibida. Observe a ordem na qual as respostas foram extraídas após '#'

source: You can assign different weights for each anwers, on the exam grade
pt: Você pode atribuir pesos diferentes a cada alternativa, na nota do exame

source: Parametric Question - Example I
pt: Questão Paramétrica - Exemplo I

source: Example with equation and figure
pt: Exemplo com equação e figura

source: Parametric Question - Example II
pt: Questão Paramétrica - Exemplo II

source: Example with graph
pt: Exemplo com grafo

source: Parametric Question - Example III
pt: Questão Paramétrica - Exemplo III

source: Example with matrix
pt: Exemplo com matriz

source: CSV File with Exam Correction
pt: Arquivo CSV com as correções dos exames

source: In yellow, answer marked '/' correct answer
pt: Em amarelo, alternativa marcada '/' alternativa correta

source: In green, Question ID in the DB and answers order (0=A, 1=B, ...)
pt: Em verde, ID da questão no BD e ordem das alternativas (0=A, 1=B, ...)

source: ID here means exam variations
pt: Aqui ID siginifica variações de Exame

source: Grade with weight
pt: Notas com pesos

source: In green, answers with weight
pt: Em verde, alternativas com pesos

source: Text parametric question, no multiple-choice
pt: Criar Questões Paramétricas, sem múltipla-escolha

source: With random values ​​for a, b, c and d. In this case, it is possible to draw the answer in light colors, see next slide
pt: Com valores aleatórios para a, b, c e d. Nesse caso, você pode desenhar a resposta em cores claras, ver o próximo slide

source: all until
pt: todos até

source: The answer in light colors, not to appear printed. You can program the answer to have a similar number of lines (same difficulty)
pt: A resposta em cores claras, para não aparecer impressa. Você pode programar a resposta para ter um número semelhante de linhas (mesma dificuldade)

source: Email corrections to each student
pt: Correções por e-mail para cada estudante

source: It is also possible to include in the email a PDF file with the text of the questions, the alternative the student has marked, the feedback and the correct alternative (if incorrect)
pt: Também é possível incluir no e-mail um arquivo PDF com o texto das questões, a alternativa que o aluno marcou, o feedback e a alternativa correta (se incorreta)

source: Email with some correction statistics
pt: Email com algumas estatísticas das correções

source: The teacher receives this email after sending a PDF of the scanned exams
pt: O professor recebe esse email após o envio de um PDF dos exames digitalizados

source: Email with test cases of moodle + VPL
pt: Email com os casos de teste do moodle + VPL

source: The teacher receives this email after creating the variations when there is an exam that contains program exercises
pt: O professor recebe esse email após criar as variações quando houver um exame que contenha exercícios programa

source: Email with templates, DBs (for import into moodle) and variation per student
pt: Email com gabaritos, BDs (para importação no moodle) e variação por aluno

source: The teacher receives this email after creating the variations when there is an exam containing multiple-choice questions or questions with answers
pt: O professor recebe esse email após criar as variações quando houver um exame que contenha questões de múltipla-escolha ou questões com respostas

source: Welcome to <em>MCTest</em>, a website designed to assist with exams preparation and correction.
pt: Bem vindo ao <em>MCTest</em>, um portal para a geração e correção de exames.
